add multi-pass explanation
